       ID DIVISION.
       PROGRAM-ID. DEMO.
      
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 A PIC X.
       01 B PIC X.
             
       PROCEDURE DIVISION.
           DISPLAY 'H'.
           ADD A TO B.
           STOP RUN.
